<!-- dflook/terraform-github-actions {"workspace":"pr_comment_approved-2","backend":"5b513570dda7e41ee0515e641a7bf1bd918e11214d1d1c216ddbf97361c23f9b","backend_type":"remote","plan_job_ref":"Job Test Terraform cloud #48 at https://github.com/dflook/terraform-github-actions/actions/runs/2799647086","plan_hash":"2944bc130e063306dc1731cd2419e0cfb4fb9691365b8374e47b3c4404e18683"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __pr_comment_approved-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables="from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + default        = "default"
  + from_tfvars    = "from_tfvars"
  + from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #48](https://github.com/dflook/terraform-github-actions/actions/runs/2799647086)